Revit 2026 API

# DocumentExport(String, String, ICollectionElementId, DWGExportOptions) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Export(
	string folder,
	string name,
	ICollection<ElementId> views,
	DWGExportOptions options
)
```
```vb
Public Function Export (
	folder As String,
	name As String,
	views As ICollection(Of ElementId),
	options As DWGExportOptions
) As Boolean
```
```cpp
public:
bool Export(
	String^ folder,
	String^ name,
	ICollection<ElementId^>^ views,
	DWGExportOptions^ options
)
```
```fsharp
member Export :
        folder : string *
        name : string *
        views : ICollection<ElementId> *
        options : DWGExportOptions -> bool
```

#### Parameters

folder String

name String

views ICollectionElementId

options DWGExportOptions

#### Return Value

Boolean

#### Reference

Document Class

Export Overload

Autodesk.Revit.DB Namespace